In [1]:
import pandas as pd

In [2]:
data = pd.read_csv("Salaries.csv")
df = data.copy()

C:\Users\user\AppData\Local\Temp\ipykernel_13144\1518665188.py:1: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  data = pd.read_csv("Salaries.csv")

In [3]:
df.dtypes

Id                    int64
EmployeeName         object
JobTitle             object
BasePay              object
OvertimePay          object
OtherPay             object
Benefits             object
TotalPay            float64
TotalPayBenefits    float64
Year                  int64
Notes               float64
Agency               object
Status               object
dtype: object

## 1. DISPLAY TOP 10 ROWS OF THE DATASET

In [4]:
df.head(10)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
5,6,DAVID SULLIVAN,ASSISTANT DEPUTY CHIEF II,118602.0,8601.0,189082.74,NaN,316285.74,316285.74,2011,NaN,San Francisco,NaN
6,7,ALSON LEE,"BATTALION CHIEF, (FIRE DEPARTMENT)",92492.01,89062.9,134426.14,NaN,315981.05,315981.05,2011,NaN,San Francisco,NaN
7,8,DAVID KUSHNER,DEPUTY DIRECTOR OF INVESTMENTS,256576.96,0.0,51322.5,NaN,307899.46,307899.46,2011,NaN,San Francisco,NaN
8,9,MICHAEL MORRIS,"BATTALION CHIEF, (FIRE DEPARTMENT)",176932.64,86362.68,40132.23,NaN,303427.55,303427.55,2011,NaN,San Francisco,NaN
9,10,JOANNE HAYES-WHITE,"CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)",285262.0,0.0,17115.73,NaN,302377.73,302377.73,2011,NaN,San Francisco,NaN

# 2. DISPLAY LAST 10 ROWS OF THE DATASET

In [5]:
df.tail(10)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148644,148645,Randy D Winn,"Stationary Eng, Sewage Plant",0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148645,148646,Carolyn A Wilson,Human Services Technician,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148646,148647,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148647,148648,Joann Anderson,Communications Dispatcher 2,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148648,148649,Leon Walker,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

## 3. FINDING THE SHAPE OF OUR DATASET

In [6]:
df.shape

(148654, 13)

## 4. GETTING INFORMATION ABOUT THE DATASET

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

## 5. CHECKING NULL VALUES IN THE DATASET

In [8]:
df.isnull().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                605
OvertimePay              0
OtherPay                 0
Benefits             36159
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              110535
dtype: int64

In [9]:
no_basepay = df[df["BasePay"].isna()]
no_basepay.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
81391,81392,Kevin P Cashman,Deputy Chief 3,NaN,0.0,149934.11,0.0,149934.11,149934.11,2013,NaN,San Francisco,NaN
84506,84507,Demetrya Mullens,Licensed Vocational Nurse,NaN,0.0,110485.41,20779.0,110485.41,131264.41,2013,NaN,San Francisco,NaN
84960,84961,Michael M Horan,Park Patrol Officer,NaN,0.0,120000.0,8841.48,120000.00,128841.48,2013,NaN,San Francisco,NaN
90525,90526,Thomas Tang,Police Officer 3,NaN,0.0,106079.31,0.0,106079.31,106079.31,2013,NaN,San Francisco,NaN
90786,90787,Michael C Hill,Deputy Sheriff,NaN,0.0,81299.02,23877.53,81299.02,105176.55,2013,NaN,San Francisco,NaN

In [10]:
check = no_basepay.eval("TotalPay == OvertimePay + OtherPay") # checking if the nan represents 0

In [11]:
check.value_counts()

True    605
Name: count, dtype: int64

In [12]:
 df["BasePay"] = df["BasePay"].fillna(0.00)

In [13]:
not_provided = df[df["BasePay"] == "Not Provided"]
not_provided

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148646,148647,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.0,0.0,2014,NaN,San Francisco,NaN
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.0,0.0,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.0,0.0,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.0,0.0,2014,NaN,San Francisco,NaN

In [14]:
df.drop(not_provided.index, inplace=True)

In [15]:
# changing some dtypes
df["BasePay"] = df["BasePay"].astype(float)
df["BasePay"] = df["BasePay"].apply(lambda x : round(x, 2))

In [16]:
df["OvertimePay"] = df["OvertimePay"].astype(float)
df["OvertimePay"] = df["OvertimePay"].apply(lambda x : round(x, 2))

In [17]:
df.dtypes

Id                    int64
EmployeeName         object
JobTitle             object
BasePay             float64
OvertimePay         float64
OtherPay             object
Benefits             object
TotalPay            float64
TotalPayBenefits    float64
Year                  int64
Notes               float64
Agency               object
Status               object
dtype: object

In [18]:
df["OtherPay"] = df["OtherPay"].astype(float)
df["Benefits"] = df["Benefits"].astype(float)

df["Benefits"] = df["Benefits"].apply(lambda x : round(x, 2))
df["OvertimePay"] = df["OvertimePay"].apply(lambda x : round(x, 2))

In [19]:
nan_benefits = df[df["Benefits"].isna()]

In [20]:
nan_benefits.sample(5)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
8637,8638,NOREEN CHAN,ASSOCIATE ENGINEER,104486.02,0.00,0.00,NaN,104486.02,104486.02,2011,NaN,San Francisco,NaN
20468,20469,EAMON CORRY,UTILITY PLUMBER,53737.07,4768.25,3274.75,NaN,61780.07,61780.07,2011,NaN,San Francisco,NaN
28070,28071,MATELINA ALEXANDER,TRANSIT OPERATOR,24392.68,4884.42,178.31,NaN,29455.41,29455.41,2011,NaN,San Francisco,NaN
30242,30243,MANASIA JAVIUS,PUBLIC SERVICE AIDE-ASSISTANT TO PROFESSIONALS,14407.09,0.00,818.92,NaN,15226.01,15226.01,2011,NaN,San Francisco,NaN
26130,26131,MANUEL ALFONSO,CUSTODIAN,39721.88,274.89,4075.95,NaN,44072.72,44072.72,2011,NaN,San Francisco,NaN

In [21]:
nan_benefits.shape

(36159, 13)

In [22]:
check = nan_benefits.eval("TotalPayBenefits == TotalPay")

In [23]:
check.value_counts()

True    36159
Name: count, dtype: int64

In [24]:
df["Benefits"] = df["Benefits"].fillna(0.00)

In [25]:
df.isna().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                  0
OvertimePay              0
OtherPay                 0
Benefits                 0
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148650
Agency                   0
Status              110531
dtype: int64

## 6. DROP ID, NOTES, AGENCY STATUS

In [26]:
df.columns

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

In [27]:
df.drop(["Id", "Notes", "Agency", "Status"], axis= 1, inplace=True)

In [28]:
df.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

## 7. GET OVERALL STATISTICS ABOUT THE DATAFRAME

In [29]:
df.describe(include="all")

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
count,148650,148650,148650.000000,148650.000000,148650.000000,148650.000000,148650.000000,148650.000000,148650.000000
unique,110810,2158,NaN,NaN,NaN,NaN,NaN,NaN,NaN
top,Kevin Lee,Transit Operator,NaN,NaN,NaN,NaN,NaN,NaN,NaN
freq,13,7036,NaN,NaN,NaN,NaN,NaN,NaN,NaN
mean,NaN,NaN,66055.506718,5066.059886,3648.767297,18924.742068,74770.333901,93695.075969,2012.522603
std,NaN,NaN,42885.919334,11454.380559,8056.601866,17165.229731,50516.196009,62792.497391,1.117526
min,NaN,NaN,-166.010000,-0.010000,-7058.590000,-33.890000,-618.130000,-618.130000,2011.000000
25%,NaN,NaN,32798.550000,0.000000,0.000000,0.000000,36169.955000,44073.337500,2012.000000
50%,NaN,NaN,64862.310000,0.000000,811.270000,23217.135000,71427.240000,92406.020000,2013.000000
75%,NaN,NaN,94609.715000,4658.175000,4236.065000,33468.980000,105842.960000,132877.992500,2014.000000
max,NaN,NaN,319275.010000,245131.880000,400184.250000,96570.660000,567595.430000,567595.430000,2014.000000

In [30]:
duplicated_names = df["EmployeeName"].value_counts()
duplicated_names

EmployeeName
Kevin Lee             13
William Wong          11
Steven Lee            11
Richard Lee           11
Stanley Lee            9
                      ..
DAVID SHINN            1
Lian Xiu Wu            1
Dario Crawford Jr.     1
Jennifer L Hammond     1
Jimmy Tang             1
Name: count, Length: 110810, dtype: int64

In [31]:
repeated_employee = duplicated_names[duplicated_names > 1].index

In [32]:
repeated_df = df[df["EmployeeName"].isin(repeated_employee)]
repeated_df

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
5,DAVID SULLIVAN,ASSISTANT DEPUTY CHIEF II,118602.00,8601.00,189082.74,0.0,316285.74,316285.74,2011
8,MICHAEL MORRIS,"BATTALION CHIEF, (FIRE DEPARTMENT)",176932.64,86362.68,40132.23,0.0,303427.55,303427.55,2011
13,JOHN MARTIN,DEPARTMENT HEAD V,271329.03,0.00,21342.59,0.0,292671.62,292671.62,2011
33,JOHN TURSI,"INSPECTOR III, (POLICE DEPARTMENT)",104861.39,50227.61,103499.39,0.0,258588.39,258588.39,2011
40,MICHAEL THOMPSON,"BATTALION CHIEF, (FIRE DEPARTMENT)",168692.66,60847.56,21055.17,0.0,250595.39,250595.39,2011
...,...,...,...,...,...,...,...,...,...
148644,Randy D Winn,"Stationary Eng, Sewage Plant",0.00,0.00,0.00,0.0,0.00,0.00,2014
148645,Carolyn A Wilson,Human Services Technician,0.00,0.00,0.00,0.0,0.00,0.00,2014
148647,Joann Anderson,Communications Dispatcher 2,0.00,0.00,0.00,0.0,0.00,0.00,2014
148648,Leon Walker,Custodian,0.00,0.00,0.00,0.0,0.00,0.00,2014
148649,Roy I Tillery,Custodian,0.00,0.00,0.00,0.0,0.00,0.00,2014

In [33]:
check = repeated_df.groupby(["EmployeeName", "Year"])["JobTitle"].nunique()
check

EmployeeName      Year
A Bernard Fatooh  2012    1
                  2014    1
AARON CRAMER      2011    2
AARON RAINEY      2011    2
AARON STEVENSON   2011    2
                         ..
Zun Jin Zhang He  2014    1
Zuna T Luu        2013    1
                  2014    1
Zuri Jones        2012    1
                  2014    1
Name: JobTitle, Length: 64523, dtype: int64

In [34]:
sorted_df = df.sort_values(["EmployeeName", "Year", "TotalPay"], ascending=[True, True, False])
df = sorted_df.drop_duplicates(subset=["EmployeeName", "Year"], keep="first")

In [35]:
df["EmployeeName"].value_counts()

EmployeeName
Kimberly S Lin          3
Mu Q Huang              3
A Bernard Fatooh        2
Diva D Lewis Hudson     2
Calvin F Chow           2
                       ..
Zohaib Khan             1
Zohreh  Khodabandelu    1
Zohreh Khodabandelu     1
Zoila  Lechuga          1
Sheila Wheeler          1
Name: count, Length: 110810, dtype: int64

## FIND THE OCCURENCE OF THE EMPLOYEE NAMES

In [36]:
df["EmployeeName"].value_counts().head()

EmployeeName
Kimberly S Lin         3
Mu Q Huang             3
A Bernard Fatooh       2
Diva D Lewis Hudson    2
Calvin F Chow          2
Name: count, dtype: int64

## FIND THE TOTAL OF UNIQUE JOB TITLES

In [37]:
df["JobTitle"].nunique()

2150

## TOTAL NUMBER OF JOB TITLES THAT CONTAINS CAPTAIN

In [38]:
df["JobTitle"].str.contains("captain", case=False).value_counts()

JobTitle
False    140510
True        550
Name: count, dtype: int64

## DISPLAY ALL EMPLOYEE FROM FIRE DEPARTMENT

In [39]:
df[df["JobTitle"].str.contains("fire", case=False)]["EmployeeName"]

682             AARON FISHER
2154         AARON STEVENSON
610             ABDUL KHADIR
2536          ADAM BUSTILLOS
11215             ADAM LEWIS
                 ...
73002     Zachary W Pumphrey
110711    Zachary W Pumphrey
73553      Zackary J Tibbits
112096     Zackary J Tibbits
36995        Zackary Tibbits
Name: EmployeeName, Length: 5832, dtype: object

## FIND MINIMUM, MAXIMUM AND AVERAGE BASEPAY

In [40]:
df["BasePay"].max()

np.float64(319275.01)

In [41]:
df["BasePay"].min()

np.float64(-166.01)

In [42]:
df["BasePay"].mean()

np.float64(68086.58844427903)

## FIND THE JOB TITLE OF ALBERT PARDINI

In [43]:
df.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [44]:
df[df["EmployeeName"] == "Albert Pardini"]["JobTitle"]

36519    Captain 3
Name: JobTitle, dtype: object

## HOW MUCH ALBERT PARDINI MAKE (INCLUDE BENEFITS) ?

In [45]:
df.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [46]:
df.sample(5)

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
11650,LONARICE WILLIAMS,PUBLIC SAFETY COMMUNICATIONS DISPATCHER,74478.35,12125.29,3853.91,0.00,90457.55,90457.55,2011
137398,Ariel E Canlapan,Electrical Line Helper,39544.00,6883.73,100.84,17768.44,46528.57,64297.01,2014
2291,MICHAEL RODRIGUEZ,SERGEANT II (POLICE DEPARTMENT),128147.10,15554.93,5282.25,0.00,148984.28,148984.28,2011
34248,JOHANNA ORNELAS,PUBLIC SERVICE AIDE-SPECIAL PROGRAMS,3010.01,0.00,0.00,0.00,3010.01,3010.01,2011
64495,Gloria Galvez,Junior Clerk,26994.48,0.00,368.45,15371.16,27362.93,42734.09,2012

In [48]:
df[df["EmployeeName"] == "Albert Pardini"]["TotalPayBenefits"]

36519    253995.29
Name: TotalPayBenefits, dtype: float64

## DISPLAY THE NAME OF THE PERSON HAVING THE HIGHEST BASE PAY

In [49]:
df.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [57]:
df[df["BasePay"] == df["BasePay"].max()]["EmployeeName"]

72925    Gregory P Suhr
Name: EmployeeName, dtype: object

## FIND AVERAGE BASE PAY OF EMPLOYEE PER YEAR

In [61]:
df.groupby(["Year"])["BasePay"].mean()

Year
2011    65597.836514
2012    67748.136267
2013    70456.711644
2014    68366.267807
Name: BasePay, dtype: float64

## AVERAGE BASE PAY OF EMPLOYEE PER JOB TITLE

In [75]:
average_pay = df.groupby(["JobTitle"])["BasePay"].mean()

## FIND AVERAGE BASE PAY OF EMPLOYEE HAVING JOB TITLE ACCOUNTANT

In [66]:
df.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [76]:
# accountant = df[df["JobTitle"].str.contains("accountant", case=True)]
# accountant
average_pay[average_pay.index.str.contains("accountant", case=False)]

JobTitle
ACCOUNTANT                   46643.172000
ACCOUNTANT INTERN            28608.216364
Accountant I                 61777.832500
Accountant II                66954.507409
Accountant III               78818.680327
Accountant IV                94223.002048
Accountant Intern            42999.328571
PRINCIPAL ACCOUNTANT         71317.480745
SENIOR ACCOUNTANT            61768.687458
SENIOR SYSTEMS ACCOUNTANT    92606.887400
Name: BasePay, dtype: float64

## FIND TOP 5 MOST COMMON JOBS

In [77]:
df.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [84]:
df["JobTitle"].value_counts().head()

JobTitle
Transit Operator                6880
Registered Nurse                3635
Public Svc Aide-Public Works    2476
Police Officer 3                2400
Custodian                       2369
Name: count, dtype: int64